In [1]:
# %matplotlib inline
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [4]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [6]:
cast = pd.read_csv('data/cast.csv', sep=",")
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [40]:
titles

                                       title  year
0                             The Rising Son  1990
1                    The Thousand Plane Raid  1969
2                           Crucea de piatra  1993
3                                    Country  2000
4                                 Gaiking II  2011
...                                      ...   ...
232325                                 E yue  2005
232326                          Lakota Girls  2015
232327                        Kroniki domowe  1997
232328                  Awakening the Zodiac  2017
232329  Death in the Valley of Good and Evil  2018

[232330 rows x 2 columns]

In [41]:
titles['title'].count()

232330

### What are the earliest two films listed in the titles dataframe?

In [43]:
titles.sort_values(by=["year"]).head(2)

                     title  year
177757          Miss Jerry  1894
215272  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [50]:
titles[titles['title'].isin(['Hamlet'])].count()

title    18
year     18
dtype: int64

### How many movies are titled "North by Northwest"?

In [51]:
titles[titles['title'].isin(["North by Northwest"])].count()

title    1
year     1
dtype: int64

        title  year
46721  Hamlet  1910

### When was the first movie titled "Hamlet" made?

In [55]:
titles[titles['title'].isin(['Hamlet'])].sort_values(by='year').head(1)

        title  year
46721  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [58]:
titles[titles['title'].isin(["Treasure Island"])].sort_values(by='year')

                  title  year
206027  Treasure Island  1918
51287   Treasure Island  1920
191050  Treasure Island  1934
96934   Treasure Island  1950
89534   Treasure Island  1972
111343  Treasure Island  1973
205397  Treasure Island  1985
179354  Treasure Island  1999

### How many movies were made in the year 1950?

In [61]:
titles[titles['year'].isin([1950])]

                             title  year
71                Campo O' Donnell  1950
90                Botta e risposta  1950
233                         Madari  1950
552            Un certain monsieur  1950
1004             Vom Teufel gejagt  1950
...                            ...   ...
230617  Na Zha da zhan Hong Hai Er  1950
231254                Dwie brygady  1950
231404                       Jogan  1950
231936                Rasuna valea  1950
232004            Thyella sto faro  1950

[1099 rows x 2 columns]

In [62]:
titles[titles['year'].isin([1950])].count()

title    1099
year     1099
dtype: int64

### How many movies were made in the year 1960?

In [63]:
titles[titles['year'].isin([1960])]

                              title  year
104                 Cone of Silence  1960
326                   The Challenge  1960
450         Dos hijos desobedientes  1960
866                Pretty Boy Floyd  1960
892               Caught in the Net  1960
...                             ...   ...
231638                        India  1960
231658                    Wu cai lu  1960
231689              Walang Pangalan  1960
231891                  Fuefukigawa  1960
232104  Il peccato degli anni verdi  1960

[1501 rows x 2 columns]

In [64]:
titles[titles['year'].isin([1960])].count()

title    1501
year     1501
dtype: int64

### How many movies were made from 1950 through 1959?

In [74]:

sorted = titles.sort_values(by=['year'])
sorted.loc[1950:1960, 'year'].count()

41459

In [78]:
# titles[titles["year"].between(1950, 1959)].info()

In [77]:
titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)]

                                         title  year
40      La momia azteca contra el robot humano  1958
45                                 Mavi boncuk  1958
71                            Campo O' Donnell  1950
90                            Botta e risposta  1950
92                         Perdeu-se um Marido  1957
...                                        ...   ...
232174               Dimas: The Sainted Robber  1952
232196                    Tischlein, deck dich  1956
232231                        Some Like It Hot  1959
232260                             Black Widow  1951
232291                       Te sigo esperando  1952

[12711 rows x 2 columns]

### In what years has a movie titled "Batman" been released?

In [83]:
batman_titles = titles[titles['title'] == "Batman"]
batman_titles['year']

56000    1989
74608    1943
Name: year, dtype: int64

In [82]:
titles[titles['title'] == "Batman"]

        title  year
56000  Batman  1989
74608  Batman  1943

In [79]:
titles[titles['title'].isin(["Batman"])]

        title  year
56000  Batman  1989
74608  Batman  1943

### How many roles were there in the movie "Inception"?

In [98]:
filter = cast['title']=="Inception"
Inception = cast[filter]
Inception['character'].count()

77

In [93]:
Inception

,title,year,name,type,character,n
94937,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
144039,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
177911,Inception,2010,Tom Berenger,actor,Browning,8.0
191432,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
251777,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
3259597,Inception,2010,Ellen Page,actress,Ariadne,3.0
3313720,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3340319,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3347057,Inception,2010,Talulah Riley,actress,Blonde,25.0
3582980,Inception,2010,Shannon Welles,actress,Old Mal,51.0

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [172]:
Inception['n'].isnull().sum()

26

### But how many roles in the movie "Inception" did receive an "n" value?

In [166]:
# import numpy as np

In [173]:
# filter = (cast['title']=="Inception") & cast['n'] != np.nan
# cast[filter]

len(Inception['n']) - Inception['n'].isnull().sum()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [184]:
filter = (cast['title'] == "North by Northwest") 
nw = cast[filter]
nw.dropna().sort_values(by='n')

,title,year,name,type,character,n
845516,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3382934,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1413409,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3043261,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
345822,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2941468,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1644542,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1236791,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2372617,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1757154,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
646039,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2225858,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
450691,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1463316,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
199768,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1343025,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [106]:
filter = (cast['title'] == 'Sleuth') & (cast['year'] == 1972)
sleuth = cast[filter]
sleuth.sort_values('n')

,title,year,name,type,character,n
1654402,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
316652,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
362592,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1421434,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2635708,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1405219,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [107]:
filter = (cast['title'] == 'Sleuth') & (cast['year'] == 2007)
sleuth = cast[filter]
sleuth.sort_values('n')

          title  year                 name     type          character    n
316653   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1254632  Sleuth  2007             Jude Law    actor               Milo  2.0
1751872  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
251883   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
362593   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2635707  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3244050  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [115]:
filter = (cast["year"] == 1921) & (cast['title'] == 'Hamlet')
hamlet_cast = cast[filter]
hamlet_cast
len(hamlet_cast['character'])

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [116]:
filter = (cast['year'] == 1996) & (cast['title'] == 'Hamlet')
hamlet_cast = cast[filter]
hamlet_cast
len(hamlet_cast['character'])

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [120]:
filter = (cast['title'] == 'Hamlet') & (cast['character'] == 'Hamlet')
hamlet_cast = cast[filter]
len(hamlet_cast['character'])

15

### How many people have played an "Ophelia"?

In [122]:
filter = cast['character'] == "Ophelia"
len(cast[filter])
# cast[filter]

,title,year,name,type,character,n
240366,The Merry Maids of Madness,2016,Amy Bourque,actor,Ophelia,11.0
397692,Jake Gets Paid,2009,Josie Chisholm,actor,Ophelia,NaN
456673,Inoperable,2016,Crystal Cordero,actor,Ophelia,NaN
840572,"Dogg's Hamlet, Cahoot's Macbeth",2005,Lucas Grabeel,actor,Ophelia,NaN
1323306,11,2014,Catherine (IV) Lord,actor,Ophelia,NaN
...,...,...,...,...,...,...
3561046,"Hamlet, Son of a Kingpin",2015,Ingrid Vollset,actress,Ophelia,NaN
3574490,D.C. Cab,1983,Marsha Warfield,actress,Ophelia,7.0
3575192,Creature,2011,Jennifer Lynn Warren,actress,Ophelia,12.0
3585205,Hamlet,2015,Katie (II) West,actress,Ophelia,7.0
3601799,Hamlet,1996,Kate Winslet,actress,Ophelia,46.0

### How many people have played a role called "The Dude"?

In [123]:
filter = cast['character'] == "The Dude"
len(cast[filter])

18

### How many people have played a role called "The Stranger"?

In [128]:
# filter = cast['character'] == "The Stranger"
len(cast[cast['character'] == "The Stranger"])

212

### How many roles has Sidney Poitier played throughout his career?

In [133]:
filter = cast['name'] == "Sidney Poitier"
sidney_cast = cast[filter]
len(sidney_cast["character"])

43

### How many roles has Judi Dench played?

In [134]:
len(cast[cast['name'] == "Judi Dench"])

54

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [144]:
filter = (cast['n'] == 2) & (cast['name'] == 'Cary Grant') & ((cast['year'] >= 1940) & (cast['year'] < 1950))
cast[filter].sort_values(by = 'year')

                   title  year        name   type    character    n
845513  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
845523    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [145]:
filter = (cast['n'] == 1) & (cast['name'] == 'Cary Grant') & ((cast['year'] >= 1940) & (cast['year'] < 1950))
cast[filter].sort_values(by = 'year')

,title,year,name,type,character,n
845539,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
845495,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
845541,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
845528,Suspicion,1941,Cary Grant,actor,Johnnie,1.0
845543,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
845519,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
845486,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
845511,Mr. Lucky,1943,Cary Grant,actor,Joe Adams,1.0
845512,Mr. Lucky,1943,Cary Grant,actor,Joe Bascopolous,1.0
845520,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
845478,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
845515,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
845514,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
845517,Notorious,1946,Cary Grant,actor,Devlin,1.0
845535,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
845536,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
845510,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
845490,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
845499,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [153]:
 filter = ((cast['year'] >= 1950) & (cast['year'] < 1960) & (cast['type']== 'actor'))
actors = (cast[filter])
len(actors['character'])

155058

### How many roles were avilable for actresses in the 1950s?

In [154]:
 filter = ((cast['year'] >= 1950) & (cast['year'] < 1960) & (cast['type']== 'actress'))
actors = (cast[filter])
len(actors['character'])

56412

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [156]:
filter = ((cast['n'] == 1) & (cast['year'] <= 1980))
len(cast[filter])

64095

### How many non-leading roles were available through from the beginning of film history through 1980?

In [160]:
filter = ((cast['n'] != 1) & (cast['year'] <= 1980))
len(cast[filter])

1097484

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [164]:
filter = ((cast['n'].isnull()) & (cast['year'] <= 1980))
len(cast[filter])
# cast[filter]

439134